<a href='https://ai.meng.duke.edu'> = <img align="left" style="padding-top:10px;" src=https://storage.googleapis.com/aipi_datasets/Duke-AIPI-Logo.png>

# Working with SQLite Databases

In [1]:
import sqlite3 as db
import pandas as pd
import numpy as np

## Connecting to a database
The sqlite engine maintains a database as a file; in the below example, the name of that file is `example.db`.
If the named file does not yet exist, it will be created when this code is run. However, if the database has been created before, this same code will open it.  Once we open the database, we then create a 'cursor', which tracks the current state of the database.  We use the cursor to issue commands that modify or query the database.

In [2]:
# Connect to a database (or create one if it doesn't exist)
conn = db.connect('example.db')

# Create a 'cursor' for executing commands
c = conn.cursor()

## Adding data to tables
The central object of a relational database is a _table_. A table has a similar form to a pandas DataFrame: observations as rows, features as columns. In the relational database world, we sometimes refer to rows as _items_ or _records_ and columns as _attributes_.

Let's start by creating a table.  Suppose we would like to create a table within `example.db` to store information about Duke students, which includes three attributes: their Duke ID number, their name, and their expected graduation year.  We will create a table called `Students` to store this information.

In [5]:
# First check if the table already exists and if so we will delete it
c.execute("DROP TABLE IF EXISTS Students")

# Create a table named "Students" with 3 columns: "duke_id" (string), "name" (string), "grad_year" (integer).
c.execute("CREATE TABLE Students (duke_id INTEGER PRIMARY KEY, name TEXT, grad_year INTEGER)")

Let's now populate our table.  To add items to the table we use the command, [`INSERT INTO`](https://www.sqlite.org/lang_insert.html).  The format of the command is `"INSERT INTO <table_name> VALUES <values>"`

In [6]:
# Commands to add data to our table
c.execute("INSERT INTO Students VALUES ('121', 'Reifschneider', 2025)")
c.execute("INSERT INTO Students VALUES ('225', 'Egger', 2023)")
c.execute("INSERT INTO Students VALUES ('767', 'Lin', 2022)")
c.execute("INSERT INTO Students VALUES ('988', 'Saha', 2022)")

# Commit the changes (make them permanent in the datbase)
conn.commit()

Rather than adding one item at a time, we can use `executemany()` to add multiple items.

In [7]:
# List of items to add
more_students = [('734', 'Fox', 2025),
                 ('878', 'Lenz', 2023),
                 ('267', 'Glass', 2023)]

# '?' question marks are placeholders for the columns in Students table
c.executemany('INSERT INTO Students VALUES (?, ?, ?)', more_students)
conn.commit()

## Basic queries
The most common operation we perform on databases is to retrieve information from them using a 'query'.  We use SQL syntax to create queries, which you can read about [here](https://data36.com/wp-content/uploads/2018/12/sql-cheat-sheet-for-data-scientists-by-tomi-mester.pdf).

The simplest form of a SQL query is `"SELECT * FROM <table_name>"` which will return all data from the table as entries in a list. Note: unless we know that our table is of reasonable size, we usually do not want to do "SELECT * FROM" because it may return a lot of data!

In [8]:
# Query to get all data from the Students table
c.execute("SELECT * FROM Students")
results = c.fetchall()
print("Results of the query:", len(results), "\nThe entries of Students:\n", results)

Results of the query: 7
The entries of Students:
 [(121, 'Reifschneider', 2025), (225, 'Egger', 2023), (267, 'Glass', 2023), (734, 'Fox', 2025), (767, 'Lin', 2022), (878, 'Lenz', 2023), (988, 'Saha', 2022)]

We can also create more complex queries using SQL which filter and/or sort the data.

In [9]:
# Query to get all students graduating in 2023
c.execute("SELECT * FROM Students WHERE grad_year=2023")
results = c.fetchall()
print("Results of the query:", len(results), "\nThe entries of Students:\n", results)

Results of the query: 3
The entries of Students:
 [(225, 'Egger', 2023), (267, 'Glass', 2023), (878, 'Lenz', 2023)]

In [10]:
# Query to return students graduating before a certain year, ordered by last name
grad_year = 2025
query = f'''
        SELECT * 
        FROM Students
        WHERE grad_year < {grad_year}
        ORDER BY Name
        '''

c.execute(query)
results = c.fetchall()
print("Results of the query:", len(results), "\nThe entries of Students:\n", results)

Results of the query: 5
The entries of Students:
 [(225, 'Egger', 2023), (267, 'Glass', 2023), (878, 'Lenz', 2023), (767, 'Lin', 2022), (988, 'Saha', 2022)]

## Join queries
The main type of query that combines information from multiple tables is the _join query_. There are four types of join queries:

- `INNER JOIN(A, B)`: Keep rows of `A` and `B` only where `A` and `B` match
- `OUTER JOIN(A, B)`: Keep all rows of `A` and `B`, but merge matching rows and fill in missing values with some default (`NaN` in Pandas, `NULL` in SQL)
- `LEFT JOIN(A, B)`: Keep all rows of `A` but only merge matches from `B`.
- `RIGHT JOIN(A, B)`: Keep all rows of `B` but only merge matches from `A`.

If you are a visual person, see [this page](https://www.codeproject.com/Articles/33052/Visual-Representation-of-SQL-Joins) for illustrations of the different join types.

Let's create a new table `Classes` which stores information on which classes each student has taken and their grade (on a 4.0 scale).  We will then run some join queries on both tables in our database.

In [11]:
# Create Classes table
c.execute('DROP TABLE IF EXISTS Classes')
c.execute('CREATE TABLE Classes (duke_id INTEGER, course TEXT, grade REAL, PRIMARY KEY("duke_id","course"))')

students = [('121','AIPI 510',3.7),
            ('121','AIPI 520',4.0),
            ('121','AIPI 530',3.3),
            ('225','AIPI 510',4.0),
            ('225','AIPI 520',3.3),
            ('767','MENG 570',3.0),
            ('767','AIPI 510',4.0),
            ('988','MENG 570',4.0),
            ('988','AIPI 510',3.7),
            ('734','AIPI 510',4.0),
            ('734','AIPI 520',4.0),
            ('878','AIPI 510',3.0),
            ('878','AIPI 520',4.0)]

c.executemany('INSERT INTO Classes VALUES (?,?,?)',students)
conn.commit()

# Displays the results of your code
c.execute('SELECT * FROM Classes')
results = c.fetchall()
print("Your results:", len(results), "\nThe entries of Classes:", results)

Your results: 13
The entries of Classes: [(121, 'AIPI 510', 3.7), (121, 'AIPI 520', 4.0), (121, 'AIPI 530', 3.3), (225, 'AIPI 510', 4.0), (225, 'AIPI 520', 3.3), (767, 'MENG 570', 3.0), (767, 'AIPI 510', 4.0), (988, 'MENG 570', 4.0), (988, 'AIPI 510', 3.7), (734, 'AIPI 510', 4.0), (734, 'AIPI 520', 4.0), (878, 'AIPI 510', 3.0), (878, 'AIPI 520', 4.0)]

Let's now perform a couple join queries using our two tables. We will need to join them on the column they both share, which is the join key.  In this case both tables share the same column `duke_id`

In [12]:
# Get all students including their name (from Students), courses taken and grades (from Classes)

query = '''
        SELECT Students.name, Classes.course, Classes.grade
        FROM Students INNER JOIN Classes ON Students.duke_id = Classes.duke_id
        '''

c.execute(query)
results = c.fetchall()
for result in results:
    print(result)

('Reifschneider', 'AIPI 510', 3.7)
('Reifschneider', 'AIPI 520', 4.0)
('Reifschneider', 'AIPI 530', 3.3)
('Egger', 'AIPI 510', 4.0)
('Egger', 'AIPI 520', 3.3)
('Lin', 'MENG 570', 3.0)
('Lin', 'AIPI 510', 4.0)
('Saha', 'MENG 570', 4.0)
('Saha', 'AIPI 510', 3.7)
('Fox', 'AIPI 510', 4.0)
('Fox', 'AIPI 520', 4.0)
('Lenz', 'AIPI 510', 3.0)
('Lenz', 'AIPI 520', 4.0)

In [13]:
# Get names and grades of all students who have taken AIPI510
course_name = 'AIPI 510'
query = f'''
        SELECT Students.name, Classes.grade
        FROM Students INNER JOIN Classes ON Students.duke_id = Classes.duke_id
        WHERE Classes.course = '{course_name}'
        '''
c.execute(query)
results = c.fetchall()
for result in results:
    print(result)

('Reifschneider', 3.7)
('Egger', 4.0)
('Lin', 4.0)
('Saha', 3.7)
('Fox', 4.0)
('Lenz', 3.0)

Let's now look at what happens when we run a join query which has missing data in one of the tables.

In [14]:
# Get all students including their name (from Students), courses taken and grades (from Classes)
# We will use a left join this time

query = '''
        SELECT Students.name, Classes.course, Classes.grade
        FROM Students LEFT JOIN Classes ON Students.duke_id = Classes.duke_id
        '''

c.execute(query)
results = c.fetchall()
for result in results:
    print(result)

('Reifschneider', 'AIPI 510', 3.7)
('Reifschneider', 'AIPI 520', 4.0)
('Reifschneider', 'AIPI 530', 3.3)
('Egger', 'AIPI 510', 4.0)
('Egger', 'AIPI 520', 3.3)
('Glass', None, None)
('Fox', 'AIPI 510', 4.0)
('Fox', 'AIPI 520', 4.0)
('Lin', 'AIPI 510', 4.0)
('Lin', 'MENG 570', 3.0)
('Lenz', 'AIPI 510', 3.0)
('Lenz', 'AIPI 520', 4.0)
('Saha', 'AIPI 510', 3.7)
('Saha', 'MENG 570', 4.0)

As we can see above, student Glass is not included in the Classes table and so when we perform the left join, we have no data available for them for `course` and `grade`.  We can run it again and exclude students who do not have any grades

In [15]:
# Get all students including their name (from Students), courses taken and grades (from Classes)
# This time exclude students with no listed classes

query = '''
        SELECT Students.name, Classes.course, Classes.grade
        FROM Students LEFT JOIN Classes ON Students.duke_id = Classes.duke_id
        WHERE Classes.course is not null
        '''

c.execute(query)
results = c.fetchall()
for result in results:
    print(result)

('Reifschneider', 'AIPI 510', 3.7)
('Reifschneider', 'AIPI 520', 4.0)
('Reifschneider', 'AIPI 530', 3.3)
('Egger', 'AIPI 510', 4.0)
('Egger', 'AIPI 520', 3.3)
('Lin', 'MENG 570', 3.0)
('Lin', 'AIPI 510', 4.0)
('Saha', 'MENG 570', 4.0)
('Saha', 'AIPI 510', 3.7)
('Fox', 'AIPI 510', 4.0)
('Fox', 'AIPI 520', 4.0)
('Lenz', 'AIPI 510', 3.0)
('Lenz', 'AIPI 520', 4.0)

## Aggregations
Another common style of query is an aggregation, which is a summary of information across multiple records. Similar to pandas, we group the data using `GROUP BY` in the query and specify how we want to aggregate across records (e.g. take the mean or sum).  Useful SQL aggregators include `AVG`,`MIN`, `MAX`, `SUM`, and `COUNT`.

In [16]:
# Calculate the average GPA of each student across all classes they have taken

query = '''
        SELECT Students.name, AVG(Classes.grade) 
        FROM Students INNER JOIN Classes ON Students.duke_id = Classes.duke_id
        GROUP BY Students.name
        '''

c.execute(query)
results = c.fetchall()
for result in results:
    print(result)

('Egger', 3.65)
('Fox', 4.0)
('Lenz', 3.5)
('Lin', 3.5)
('Reifschneider', 3.6666666666666665)
('Saha', 3.85)

In [17]:
# Get the count of how many classes each student has taken so far

query = '''
        SELECT Students.name, COUNT(Classes.course)
        FROM Students INNER JOIN Classes ON Students.duke_id = Classes.duke_id
        GROUP BY Students.name
        '''

c.execute(query)
results = c.fetchall()
for result in results:
    print(result)

('Egger', 2)
('Fox', 2)
('Lenz', 2)
('Lin', 2)
('Reifschneider', 3)
('Saha', 2)

## SQL and Pandas
We can read SQL queries directly into pandas to create DataFrames of the results.

In [18]:
# Get a dataframe with all data from Students and Classes tables
query = '''
        SELECT Students.duke_id, Students.name, Students.grad_year, Classes.course, Classes.grade
        FROM Students INNER JOIN Classes ON Students.duke_id = Classes.duke_id
        '''

df = pd.read_sql_query (query, conn)
df

    duke_id           name  grad_year    course  grade
0       121  Reifschneider       2025  AIPI 510    3.7
1       121  Reifschneider       2025  AIPI 520    4.0
2       121  Reifschneider       2025  AIPI 530    3.3
3       225          Egger       2023  AIPI 510    4.0
4       225          Egger       2023  AIPI 520    3.3
5       767            Lin       2022  MENG 570    3.0
6       767            Lin       2022  AIPI 510    4.0
7       988           Saha       2022  MENG 570    4.0
8       988           Saha       2022  AIPI 510    3.7
9       734            Fox       2025  AIPI 510    4.0
10      734            Fox       2025  AIPI 520    4.0
11      878           Lenz       2023  AIPI 510    3.0
12      878           Lenz       2023  AIPI 520    4.0

In [19]:
# Get a dataframe of students, their graduation year and their GPA
# Rename the average grade column to 'gpa' using AS
query = '''
        SELECT Students.duke_id, Students.name, Students.grad_year, AVG(Classes.grade) AS gpa
        FROM Students INNER JOIN Classes ON Students.duke_id = Classes.duke_id
        GROUP BY Students.name
        '''

df = pd.read_sql_query (query, conn,index_col='duke_id')
df

                  name  grad_year       gpa
duke_id
225              Egger       2023  3.650000
734                Fox       2025  4.000000
878               Lenz       2023  3.500000
767                Lin       2022  3.500000
121      Reifschneider       2025  3.666667
988               Saha       2022  3.850000

We can also save data directly from a pandas dataframe to a table in a sqlite database.

In [20]:
# Create dataframe of students' major
majors_dict={'duke_id':['225','734','878','878','121','267'],
             'major':['Biology','Finance','CS','AI','CS','Biology']}
majors = pd.DataFrame(majors_dict)

# Create table Majors from dataframe in example.db
conn = db.connect('example.db')
c = conn.cursor()
c.execute("DROP TABLE IF EXISTS Majors")
majors.to_sql(name='Majors',con=conn,index=False)

In [21]:
# We can now query our new table
df = pd.read_sql_query ("SELECT * FROM Majors", conn)
df

  duke_id    major
0     225  Biology
1     734  Finance
2     878       CS
3     878       AI
4     121       CS
5     267  Biology